const cityPositions = {
    札幌市: { top: '50%', left: '20%' },
    旭川市: { top: '45%', left: '40%' },
    函館市: { top: '70%', left: '5%' },

    青森市: { top: '50%', left: '40%' },
    八戸市: { top: '70%', left: '80%' },

    盛岡市: { top: '40%', left: '30%' },

    仙台市: { top: '50%', left: '40%' },

    秋田市: { top: '40%', left: '45%' },

    山形市: { top: '60%', left: '55%' },

    福島市: { top: '30%', left: '60%' },

    水戸市: { top: '50%', left: '70%' },

    宇都宮市: { top: '60%', left: '50%' },

    前橋市: { top: '65%', left: '50%' },

    さいたま市: { top: '60%', left: '65%' },

    千葉市: { top: '30%', left: '40%' },

    調布市: { top: '55%', left: '70%' },

    横浜市: { top: '50%', left: '75%' },
    川崎市: { top: '18%', left: '85%' },

    新潟市: { top: '40%', left: '60%' },

    富山市: { top: '45%', left: '45%' },

    金沢市: { top: '60%', left: '45%' },

    福井市: { top: '30%', left: '60%' },

    甲府市: { top: '40%', left: '40%' },

    長野市: { top: '25%', left: '60%' },

    岐阜市: { top: '70%', left: '45%' },

    静岡市: { top: '55%', left: '50%' },
    浜松市: { top: '80%', left: '25%' },

    名古屋市: { top: '35%', left: '20%' },

    津市: { top: '35%', left: '50%' },

    大津市: { top: '70%', left: '35%' },

    京都市: { top: '65%', left: '70%' },

    大阪市: { top: '40%', left: '60%' },

    神戸市: { top: '50%', left: '70%' },
    姫路市: { top: '45%', left: '40%' },

    奈良市: { top: '20%', left: '40%' },

    和歌山市: { top: '15%', left: '25%' },

    鳥取市: { top: '30%', left: '70%' },

    松江市: { top: '40%', left: '70%' },

    岡山市: { top: '75%', left: '50%' },

    広島市: { top: '60%', left: '30%' },

    山口市: { top: '50%', left: '40%' },

    徳島市: { top: '30%', left: '80%' },

    高松市: { top: '40%', left: '50%' },

    松山市: { top: '30%', left: '35%' },

    高知市: { top: '40%', left: '55%' },

    福岡市: { top: '30%', left: '30%' },
    北九州市: { top: '17%', left: '70%' },

    佐賀市: { top: '45%', left: '70%' },

    長崎市: { top: '83%', left: '70%' },

    熊本市: { top: '30%', left: '60%' },

    大分市: { top: '45%', left: '65%' },

    宮崎市: { top: '45%', left: '60%' },

    鹿児島市: { top: '30%', left: '40%' },
    那覇市: { top: '70%', left: '60%' },
}
export default cityPositions
